Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectAttributes Constructor
 Initializes a new instance of the EmbeddedObjectAttributes class that loads standard attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public EmbeddedObjectAttributes()
Public Sub New
See Also
Reference
EmbeddedObjectAttributes Class
EmbeddedObjectAttributes Overload
Tekla.Structures.Drawing Namespace